GopalSaraf/Practicals/PSDL/include/proc/pic18f64j90.inc
// Register: ADRES
#define ADRES ADRES
ADRES                                    equ 0FC3h

// Register: ADRESL
#define ADRESL ADRESL
ADRESL                                   equ 0FC3h

// Register: ADRESH
#define ADRESH ADRESH
ADRESH                                   equ 0FC4h

// Register: SSPCON2
#define SSPCON2 SSPCON2
SSPCON2                                  equ 0FC5h
// bitfield definitions
SSPCON2_SEN_POSN                         equ 0000h
SSPCON2_SEN_POSITION                     equ 0000h
SSPCON2_SEN_SIZE                         equ 0001h
SSPCON2_SEN_LENGTH                       equ 0001h
SSPCON2_SEN_MASK                         equ 0001h
SSPCON2_RSEN_POSN                        equ 0001h
SSPCON2_RSEN_POSITION                    equ 0001h
SSPCON2_RSEN_SIZE                        equ 0001h
SSPCON2_RSEN_LENGTH                      equ 0001h
SSPCON2_RSEN_MASK                        equ 0002h
SSPCON2_PEN_POSN                         equ 0002h
SSPCON2_PEN_POSITION                     equ 0002h
SSPCON2_PEN_SIZE                         equ 0001h
SSPCON2_PEN_LENGTH                       equ 0001h
SSPCON2_PEN_MASK                         equ 0004h
SSPCON2_RCEN_POSN                        equ 0003h
SSPCON2_RCEN_POSITION                    equ 0003h
SSPCON2_RCEN_SIZE                        equ 0001h
SSPCON2_RCEN_LENGTH                      equ 0001h
SSPCON2_RCEN_MASK                        equ 0008h
SSPCON2_ACKEN_POSN                       equ 0004h
SSPCON2_ACKEN_POSITION                   equ 0004h
SSPCON2_ACKEN_SIZE                       equ 0001h
SSPCON2_ACKEN_LENGTH                     equ 0001h
SSPCON2_ACKEN_MASK                       equ 0010h
SSPCON2_ACKDT_POSN                       equ 0005h
SSPCON2_ACKDT_POSITION                   equ 0005h
SSPCON2_ACKDT_SIZE                       equ 0001h
SSPCON2_ACKDT_LENGTH                     equ 0001h
SSPCON2_ACKDT_MASK                       equ 0020h
SSPCON2_ACKSTAT_POSN                     equ 0006h
SSPCON2_ACKSTAT_POSITION                 equ 0006h
SSPCON2_ACKSTAT_SIZE                     equ 0001h
SSPCON2_ACKSTAT_LENGTH                   equ 0001h
SSPCON2_ACKSTAT_MASK                     equ 0040h
SSPCON2_GCEN_POSN                        equ 0007h
SSPCON2_GCEN_POSITION                    equ 0007h
SSPCON2_GCEN_SIZE                        equ 0001h
SSPCON2_GCEN_LENGTH                      equ 0001h
SSPCON2_GCEN_MASK                        equ 0080h
SSPCON2_ADMSK1_POSN                      equ 0001h
SSPCON2_ADMSK1_POSITION                  equ 0001h
SSPCON2_ADMSK1_SIZE                      equ 0001h
SSPCON2_ADMSK1_LENGTH                    equ 0001h
SSPCON2_ADMSK1_MASK                      equ 0002h
SSPCON2_ADMSK2_POSN                      equ 0002h
SSPCON2_ADMSK2_POSITION                  equ 0002h
SSPCON2_ADMSK2_SIZE                      equ 0001h
SSPCON2_ADMSK2_LENGTH                    equ 0001h
SSPCON2_ADMSK2_MASK                      equ 0004h
SSPCON2_ADMSK3_POSN                      equ 0003h
SSPCON2_ADMSK3_POSITION                  equ 0003h
SSPCON2_ADMSK3_SIZE                      equ 0001h
SSPCON2_ADMSK3_LENGTH                    equ 0001h
SSPCON2_ADMSK3_MASK                      equ 0008h
SSPCON2_ADMSK4_POSN                      equ 0004h
SSPCON2_ADMSK4_POSITION                  equ 0004h
SSPCON2_ADMSK4_SIZE                      equ 0001h
SSPCON2_ADMSK4_LENGTH                    equ 0001h
SSPCON2_ADMSK4_MASK                      equ 0010h
SSPCON2_ADMSK5_POSN                      equ 0005h
SSPCON2_ADMSK5_POSITION                  equ 0005h
SSPCON2_ADMSK5_SIZE                      equ 0001h
SSPCON2_ADMSK5_LENGTH                    equ 0001h
SSPCON2_ADMSK5_MASK                      equ 0020h
SSPCON2_ACKDT1_POSN                      equ 0005h
SSPCON2_ACKDT1_POSITION                  equ 0005h
SSPCON2_ACKDT1_SIZE                      equ 0001h
SSPCON2_ACKDT1_LENGTH                    equ 0001h
SSPCON2_ACKDT1_MASK                      equ 0020h
SSPCON2_ACKEN1_POSN                      equ 0004h
SSPCON2_ACKEN1_POSITION                  equ 0004h
SSPCON2_ACKEN1_SIZE                      equ 0001h
SSPCON2_ACKEN1_LENGTH                    equ 0001h
SSPCON2_ACKEN1_MASK                      equ 0010h
SSPCON2_ACKSTAT1_POSN                    equ 0006h
SSPCON2_ACKSTAT1_POSITION                equ 0006h
SSPCON2_ACKSTAT1_SIZE                    equ 0001h
SSPCON2_ACKSTAT1_LENGTH                  equ 0001h
SSPCON2_ACKSTAT1_MASK                    equ 0040h
SSPCON2_ADMSK11_POSN                     equ 0001h
SSPCON2_ADMSK11_POSITION                 equ 0001h
SSPCON2_ADMSK11_SIZE                     equ 0001h
SSPCON2_ADMSK11_LENGTH                   equ 0001h
SSPCON2_ADMSK11_MASK                     equ 0002h
SSPCON2_ADMSK21_POSN                     equ 0002h
SSPCON2_ADMSK21_POSITION                 equ 0002h
SSPCON2_ADMSK21_SIZE                     equ 0001h
SSPCON2_ADMSK21_LENGTH                   equ 0001h
SSPCON2_ADMSK21_MASK                     equ 0004h
SSPCON2_ADMSK31_POSN                     equ 0003h
SSPCON2_ADMSK31_POSITION                 equ 0003h
SSPCON2_ADMSK31_SIZE                     equ 0001h
SSPCON2_ADMSK31_LENGTH                   equ 0001h
SSPCON2_ADMSK31_MASK                     equ 0008h
SSPCON2_ADMSK41_POSN                     equ 0004h
SSPCON2_ADMSK41_POSITION                 equ 0004h
SSPCON2_ADMSK41_SIZE                     equ 0001h
SSPCON2_ADMSK41_LENGTH                   equ 0001h
SSPCON2_ADMSK41_MASK                     equ 0010h
SSPCON2_ADMSK51_POSN                     equ 0005h
SSPCON2_ADMSK51_POSITION                 equ 0005h
SSPCON2_ADMSK51_SIZE                     equ 0001h
SSPCON2_ADMSK51_LENGTH                   equ 0001h
SSPCON2_ADMSK51_MASK                     equ 0020h
SSPCON2_GCEN1_POSN                       equ 0007h
SSPCON2_GCEN1_POSITION                   equ 0007h
SSPCON2_GCEN1_SIZE                       equ 0001h
SSPCON2_GCEN1_LENGTH                     equ 0001h
SSPCON2_GCEN1_MASK                       equ 0080h
SSPCON2_PEN1_POSN                        equ 0002h
SSPCON2_PEN1_POSITION                    equ 0002h
SSPCON2_PEN1_SIZE                        equ 0001h
SSPCON2_PEN1_LENGTH                      equ 0001h
SSPCON2_PEN1_MASK                        equ 0004h
SSPCON2_RCEN1_POSN                       equ 0003h
SSPCON2_RCEN1_POSITION                   equ 0003h
SSPCON2_RCEN1_SIZE                       equ 0001h
SSPCON2_RCEN1_LENGTH                     equ 0001h
SSPCON2_RCEN1_MASK                       equ 0008h
SSPCON2_RSEN1_POSN                       equ 0001h
SSPCON2_RSEN1_POSITION                   equ 0001h
SSPCON2_RSEN1_SIZE                       equ 0001h
SSPCON2_RSEN1_LENGTH                     equ 0001h
SSPCON2_RSEN1_MASK                       equ 0002h
SSPCON2_SEN1_POSN                        equ 0000h
SSPCON2_SEN1_POSITION                    equ 0000h
SSPCON2_SEN1_SIZE                        equ 0001h
SSPCON2_SEN1_LENGTH                      equ 0001h
SSPCON2_SEN1_MASK                        equ 0001h

// Register: SSPCON1
#define SSPCON1 SSPCON1
SSPCON1                                  equ 0FC6h
// bitfield definitions
SSPCON1_SSPM_POSN                        equ 0000h
SSPCON1_SSPM_POSITION                    equ 0000h
SSPCON1_SSPM_SIZE                        equ 0004h
SSPCON1_SSPM_LENGTH                      equ 0004h
SSPCON1_SSPM_MASK                        equ 000Fh
SSPCON1_CKP_POSN                         equ 0004h
SSPCON1_CKP_POSITION                     equ 0004h
SSPCON1_CKP_SIZE                         equ 0001h
SSPCON1_CKP_LENGTH                       equ 0001h
SSPCON1_CKP_MASK                         equ 0010h
SSPCON1_SSPEN_POSN                       equ 0005h
SSPCON1_SSPEN_POSITION                   equ 0005h
SSPCON1_SSPEN_SIZE                       equ 0001h
SSPCON1_SSPEN_LENGTH                     equ 0001h
SSPCON1_SSPEN_MASK                       equ 0020h
SSPCON1_SSPOV_POSN                       equ 0006h
SSPCON1_SSPOV_POSITION                   equ 0006h
SSPCON1_SSPOV_SIZE                       equ 0001h
SSPCON1_SSPOV_LENGTH                     equ 0001h
SSPCON1_SSPOV_MASK                       equ 0040h
SSPCON1_WCOL_POSN                        equ 0007h
SSPCON1_WCOL_POSITION                    equ 0007h
SSPCON1_WCOL_SIZE                        equ 0001h
SSPCON1_WCOL_LENGTH                      equ 0001h
SSPCON1_WCOL_MASK                        equ 0080h
SSPCON1_SSPM0_POSN                       equ 0000h
SSPCON1_SSPM0_POSITION                   equ 0000h
SSPCON1_SSPM0_SIZE                       equ 0001h
SSPCON1_SSPM0_LENGTH                     equ 0001h
SSPCON1_SSPM0_MASK                       equ 0001h
SSPCON1_SSPM1_POSN                       equ 0001h
SSPCON1_SSPM1_POSITION                   equ 0001h
SSPCON1_SSPM1_SIZE                       equ 0001h
SSPCON1_SSPM1_LENGTH                     equ 0001h
SSPCON1_SSPM1_MASK                       equ 0002h
SSPCON1_SSPM2_POSN                       equ 0002h
SSPCON1_SSPM2_POSITION                   equ 0002h
SSPCON1_SSPM2_SIZE                       equ 0001h
SSPCON1_SSPM2_LENGTH                     equ 0001h
SSPCON1_SSPM2_MASK                       equ 0004h
SSPCON1_SSPM3_POSN                       equ 0003h
SSPCON1_SSPM3_POSITION                   equ 0003h
SSPCON1_SSPM3_SIZE                       equ 0001h
SSPCON1_SSPM3_LENGTH                     equ 0001h
SSPCON1_SSPM3_MASK                       equ 0008h
SSPCON1_CKP1_POSN                        equ 0004h
SSPCON1_CKP1_POSITION                    equ 0004h
SSPCON1_CKP1_SIZE                        equ 0001h
SSPCON1_CKP1_LENGTH                      equ 0001h
SSPCON1_CKP1_MASK                        equ 0010h
SSPCON1_SSPEN1_POSN                      equ 0005h
SSPCON1_SSPEN1_POSITION                  equ 0005h
SSPCON1_SSPEN1_SIZE                      equ 0001h
SSPCON1_SSPEN1_LENGTH                    equ 0001h
SSPCON1_SSPEN1_MASK                      equ 0020h
SSPCON1_SSPM01_POSN                      equ 0000h
SSPCON1_SSPM01_POSITION                  equ 0000h
SSPCON1_SSPM01_SIZE                      equ 0001h
SSPCON1_SSPM01_LENGTH                    equ 0001h
SSPCON1_SSPM01_MASK                      equ 0001h
SSPCON1_SSPM11_POSN                      equ 0001h
SSPCON1_SSPM11_POSITION                  equ 0001h
SSPCON1_SSPM11_SIZE                      equ 0001h
SSPCON1_SSPM11_LENGTH                    equ 0001h
SSPCON1_SSPM11_MASK                      equ 0002h
SSPCON1_SSPM21_POSN                      equ 0002h
SSPCON1_SSPM21_POSITION                  equ 0002h
SSPCON1_SSPM21_SIZE                      equ 0001h
SSPCON1_SSPM21_LENGTH                    equ 0001h
SSPCON1_SSPM21_MASK                      equ 0004h
SSPCON1_SSPM31_POSN                      equ 0003h
SSPCON1_SSPM31_POSITION                  equ 0003h
SSPCON1_SSPM31_SIZE                      equ 0001h
SSPCON1_SSPM31_LENGTH                    equ 0001h
SSPCON1_SSPM31_MASK                      equ 0008h
SSPCON1_SSPOV1_POSN                      equ 0006h
SSPCON1_SSPOV1_POSITION                  equ 0006h
SSPCON1_SSPOV1_SIZE                      equ 0001h
SSPCON1_SSPOV1_LENGTH                    equ 0001h
SSPCON1_SSPOV1_MASK                      equ 0040h
SSPCON1_WCOL1_POSN                       equ 0007h
SSPCON1_WCOL1_POSITION                   equ 0007h
SSPCON1_WCOL1_SIZE                       equ 0001h
SSPCON1_WCOL1_LENGTH                     equ 0001h
SSPCON1_WCOL1_MASK                       equ 0080h

// Register: SSPSTAT
#define SSPSTAT SSPSTAT
SSPSTAT                                  equ 0FC7h
// bitfield definitions
SSPSTAT_R_NOT_W_POSN                     equ 0002h
SSPSTAT_R_NOT_W_POSITION                 equ 0002h
SSPSTAT_R_NOT_W_SIZE                     equ 0001h
SSPSTAT_R_NOT_W_LENGTH                   equ 0001h
SSPSTAT_R_NOT_W_MASK                     equ 0004h
SSPSTAT_D_NOT_A_POSN                     equ 0005h
SSPSTAT_D_NOT_A_POSITION                 equ 0005h
SSPSTAT_D_NOT_A_SIZE                     equ 0001h
SSPSTAT_D_NOT_A_LENGTH                   equ 0001h
SSPSTAT_D_NOT_A_MASK                     equ 0020h
SSPSTAT_BF_POSN                          equ 0000h
SSPSTAT_BF_POSITION                      equ 0000h
SSPSTAT_BF_SIZE                          equ 0001h
SSPSTAT_BF_LENGTH                        equ 0001h
SSPSTAT_BF_MASK                          equ 0001h
SSPSTAT_UA_POSN                          equ 0001h
SSPSTAT_UA_POSITION                      equ 0001h
SSPSTAT_UA_SIZE                          equ 0001h
SSPSTAT_UA_LENGTH                        equ 0001h
SSPSTAT_UA_MASK                          equ 0002h
SSPSTAT_R_nW_POSN                        equ 0002h
SSPSTAT_R_nW_POSITION                    equ 0002h
SSPSTAT_R_nW_SIZE                        equ 0001h
SSPSTAT_R_nW_LENGTH                      equ 0001h
SSPSTAT_R_nW_MASK                        equ 0004h
SSPSTAT_S_POSN                           equ 0003h
SSPSTAT_S_POSITION                       equ 0003h
SSPSTAT_S_SIZE                           equ 0001h
SSPSTAT_S_LENGTH                         equ 0001h
SSPSTAT_S_MASK                           equ 0008h
SSPSTAT_P_POSN                           equ 0004h
SSPSTAT_P_POSITION                       equ 0004h
SSPSTAT_P_SIZE                           equ 0001h
SSPSTAT_P_LENGTH                         equ 0001h
SSPSTAT_P_MASK                           equ 0010h
SSPSTAT_D_nA_POSN                        equ 0005h
SSPSTAT_D_nA_POSITION                    equ 0005h
SSPSTAT_D_nA_SIZE                        equ 0001h
SSPSTAT_D_nA_LENGTH                      equ 0001h
SSPSTAT_D_nA_MASK                        equ 0020h
SSPSTAT_CKE_POSN                         equ 0006h
SSPSTAT_CKE_POSITION                     equ 0006h
SSPSTAT_CKE_SIZE                         equ 0001h
SSPSTAT_CKE_LENGTH                       equ 0001h
SSPSTAT_CKE_MASK                         equ 0040h
SSPSTAT_SMP_POSN                         equ 0007h
SSPSTAT_SMP_POSITION                     equ 0007h
SSPSTAT_SMP_SIZE                         equ 0001h
SSPSTAT_SMP_LENGTH                       equ 0001h
SSPSTAT_SMP_MASK                         equ 0080h
SSPSTAT_R_POSN                           equ 0002h
SSPSTAT_R_POSITION                       equ 0002h
SSPSTAT_R_SIZE                           equ 0001h
SSPSTAT_R_LENGTH                         equ 0001h
SSPSTAT_R_MASK                           equ 0004h
SSPSTAT_D_POSN                           equ 0005h
SSPSTAT_D_POSITION                       equ 0005h
SSPSTAT_D_SIZE                           equ 0001h
SSPSTAT_D_LENGTH                         equ 0001h
SSPSTAT_D_MASK                           equ 0020h
SSPSTAT_R_W_POSN                         equ 0002h
SSPSTAT_R_W_POSITION                     equ 0002h
SSPSTAT_R_W_SIZE                         equ 0001h
SSPSTAT_R_W_LENGTH                       equ 0001h
SSPSTAT_R_W_MASK                         equ 0004h
SSPSTAT_D_A_POSN                         equ 0005h
SSPSTAT_D_A_POSITION                     equ 0005h
SSPSTAT_D_A_SIZE                         equ 0001h
SSPSTAT_D_A_LENGTH                       equ 0001h
SSPSTAT_D_A_MASK                         equ 0020h
SSPSTAT_nW_POSN                          equ 0002h
SSPSTAT_nW_POSITION                      equ 0002h
SSPSTAT_nW_SIZE                          equ 0001h
SSPSTAT_nW_LENGTH                        equ 0001h
SSPSTAT_nW_MASK                          equ 0004h
SSPSTAT_nA_POSN                          equ 0005h
SSPSTAT_nA_POSITION                      equ 0005h
SSPSTAT_nA_SIZE                          equ 0001h
SSPSTAT_nA_LENGTH                        equ 0001h
SSPSTAT_nA_MASK                          equ 0020h
SSPSTAT_NOT_WRITE_POSN                   equ 0002h
SSPSTAT_NOT_WRITE_POSITION               equ 0002h
SSPSTAT_NOT_WRITE_SIZE                   equ 0001h
SSPSTAT_NOT_WRITE_LENGTH                 equ 0001h
SSPSTAT_NOT_WRITE_MASK                   equ 0004h
SSPSTAT_NOT_ADDRESS_POSN                 equ 0005h
SSPSTAT_NOT_ADDRESS_POSITION             equ 0005h
SSPSTAT_NOT_ADDRESS_SIZE                 equ 0001h
SSPSTAT_NOT_ADDRESS_LENGTH               equ 0001h
SSPSTAT_NOT_ADDRESS_MASK                 equ 0020h
SSPSTAT_nWRITE_POSN                      equ 0002h
SSPSTAT_nWRITE_POSITION                  equ 0002h
SSPSTAT_nWRITE_SIZE                      equ 0001h
SSPSTAT_nWRITE_LENGTH                    equ 0001h
SSPSTAT_nWRITE_MASK                      equ 0004h
SSPSTAT_nADDRESS_POSN                    equ 0005h
SSPSTAT_nADDRESS_POSITION                equ 0005h
SSPSTAT_nADDRESS_SIZE                    equ 0001h
SSPSTAT_nADDRESS_LENGTH                  equ 0001h
SSPSTAT_nADDRESS_MASK                    equ 0020h
SSPSTAT_READ_WRITE_POSN                  equ 0002h
SSPSTAT_READ_WRITE_POSITION              equ 0002h
SSPSTAT_READ_WRITE_SIZE                  equ 0001h
SSPSTAT_READ_WRITE_LENGTH                equ 0001h
SSPSTAT_READ_WRITE_MASK                  equ 0004h
SSPSTAT_DATA_ADDRESS_POSN                equ 0005h
SSPSTAT_DATA_ADDRESS_POSITION            equ 0005h
SSPSTAT_DATA_ADDRESS_SIZE                equ 0001h
SSPSTAT_DATA_ADDRESS_LENGTH              equ 0001h
SSPSTAT_DATA_ADDRESS_MASK                equ 0020h
SSPSTAT_I2C_READ_POSN                    equ 0002h
SSPSTAT_I2C_READ_POSITION                equ 0002h
SSPSTAT_I2C_READ_SIZE                    equ 0001h
SSPSTAT_I2C_READ_LENGTH                  equ 0001h
SSPSTAT_I2C_READ_MASK                    equ 0004h
SSPSTAT_I2C_START_POSN                   equ 0003h
SSPSTAT_I2C_START_POSITION               equ 0003h
SSPSTAT_I2C_START_SIZE                   equ 0001h
SSPSTAT_I2C_START_LENGTH                 equ 0001h
SSPSTAT_I2C_START_MASK                   equ 0008h
SSPSTAT_I2C_STOP_POSN                    equ 0004h
SSPSTAT_I2C_STOP_POSITION                equ 0004h
SSPSTAT_I2C_STOP_SIZE                    equ 0001h
SSPSTAT_I2C_STOP_LENGTH                  equ 0001h
SSPSTAT_I2C_STOP_MASK                    equ 0010h
SSPSTAT_I2C_DAT_POSN                     equ 0005h
SSPSTAT_I2C_DAT_POSITION                 equ 0005h
SSPSTAT_I2C_DAT_SIZE                     equ 0001h
SSPSTAT_I2C_DAT_LENGTH                   equ 0001h
SSPSTAT_I2C_DAT_MASK                     equ 0020h
SSPSTAT_RW_POSN                          equ 0002h
SSPSTAT_RW_POSITION                      equ 0002h
SSPSTAT_RW_SIZE                          equ 0001h
SSPSTAT_RW_LENGTH                        equ 0001h
SSPSTAT_RW_MASK                          equ 0004h
SSPSTAT_START_POSN                       equ 0003h
SSPSTAT_START_POSITION                   equ 0003h
SSPSTAT_START_SIZE                       equ 0001h
SSPSTAT_START_LENGTH                     equ 0001h
SSPSTAT_START_MASK                       equ 0008h
SSPSTAT_STOP_POSN                        equ 0004h
SSPSTAT_STOP_POSITION                    equ 0004h
SSPSTAT_STOP_SIZE                        equ 0001h
SSPSTAT_STOP_LENGTH                      equ 0001h
SSPSTAT_STOP_MASK                        equ 0010h
SSPSTAT_DA_POSN                          equ 0005h
SSPSTAT_DA_POSITION                      equ 0005h
SSPSTAT_DA_SIZE                          equ 0001h
SSPSTAT_DA_LENGTH                        equ 0001h
SSPSTAT_DA_MASK                          equ 0020h
SSPSTAT_NOT_W_POSN                       equ 0002h
SSPSTAT_NOT_W_POSITION                   equ 0002h
SSPSTAT_NOT_W_SIZE                       equ 0001h
SSPSTAT_NOT_W_LENGTH                     equ 0001h
SSPSTAT_NOT_W_MASK                       equ 0004h
SSPSTAT_NOT_A_POSN                       equ 0005h
SSPSTAT_NOT_A_POSITION                   equ 0005h
SSPSTAT_NOT_A_SIZE                       equ 0001h
SSPSTAT_NOT_A_LENGTH                     equ 0001h
SSPSTAT_NOT_A_MASK                       equ 0020h
SSPSTAT_BF1_POSN                         equ 0000h
SSPSTAT_BF1_POSITION                     equ 0000h
SSPSTAT_BF1_SIZE                         equ 0001h
SSPSTAT_BF1_LENGTH                       equ 0001h
SSPSTAT_BF1_MASK                         equ 0001h
SSPSTAT_CKE1_POSN                        equ 0006h
SSPSTAT_CKE1_POSITION                    equ 0006h
SSPSTAT_CKE1_SIZE                        equ 0001h
SSPSTAT_CKE1_LENGTH                      equ 0001h
SSPSTAT_CKE1_MASK                        equ 0040h
SSPSTAT_DA1_POSN                         equ 0005h
SSPSTAT_DA1_POSITION                     equ 0005h
SSPSTAT_DA1_SIZE                         equ 0001h
SSPSTAT_DA1_LENGTH                       equ 0001h
SSPSTAT_DA1_MASK                         equ 0020h
SSPSTAT_RW1_POSN                         equ 0002h
SSPSTAT_RW1_POSITION                     equ 0002h
SSPSTAT_RW1_SIZE                         equ 0001h
SSPSTAT_RW1_LENGTH                       equ 0001h
SSPSTAT_RW1_MASK                         equ 0004h
SSPSTAT_SMP1_POSN                        equ 0007h
SSPSTAT_SMP1_POSITION                    equ 0007h
SSPSTAT_SMP1_SIZE                        equ 0001h
SSPSTAT_SMP1_LENGTH                      equ 0001h
SSPSTAT_SMP1_MASK                        equ 0080h
SSPSTAT_START1_POSN                      equ 0003h
SSPSTAT_START1_POSITION                  equ 0003h
SSPSTAT_START1_SIZE                      equ 0001h
SSPSTAT_START1_LENGTH                    equ 0001h
SSPSTAT_START1_MASK                      equ 0008h
SSPSTAT_STOP1_POSN                       equ 0004h
SSPSTAT_STOP1_POSITION                   equ 0004h
SSPSTAT_STOP1_SIZE                       equ 0001h
SSPSTAT_STOP1_LENGTH                     equ 0001h
SSPSTAT_STOP1_MASK                       equ 0010h
SSPSTAT_UA1_POSN                         equ 0001h
SSPSTAT_UA1_POSITION                     equ 0001h
SSPSTAT_UA1_SIZE                         equ 0001h
SSPSTAT_UA1_LENGTH                       equ 0001h
SSPSTAT_UA1_MASK                         equ 0002h

